{
    "snippets": [
      {
        "title": "Start JSON Server",
        "tags": "json-server",
        "languageSelect": "Terminal Commands",
        "code": "json-server --watch db.json -p 5555",
        "explanation": "Starts json server on the specified port, 5555 in this case. ",
        "id": 2
      },
      {
        "title": "Delete Object from Stateful Array",
        "tags": "Delete",
        "languageSelect": "JavaScript",
        "code": "setSnippets(snippets.filter((snippet) => snippet.id !== snippetId));",
        "explanation": "calls the filter method on the snippets state-ful array of objects, compares each object with the specified snippetId, and creates a new array with each object whose id does not match snippetId. It then passes the new array into the setSnippets state method. Since it omits the curly braces, calling setSnippets is intended to take up only one line. ",
        "id": 3
      },
      {
        "title": "Run Python Script",
        "tags": "Python, Script",
        "languageSelect": "Python",
        "code": "python app.py",
        "explanation": "Runs a script on the command line. Replace \"App\" with the name of the file you want to run. ",
        "id": 4
      },
      {
        "title": "Python Format Method",
        "tags": "python, string, str, OOP",
        "languageSelect": "Python",
        "code": "def role_call(self):    \n        return \"This is {}. He is is {}\".format(self.title, self.department)",
        "explanation": "This method uses placeholders {} in the string and replaces them with the values of self.title and self.department respectively. The .format() method is a powerful tool in Python for creating formatted strings by embedding variables and values into placeholders within a template string. It offers a flexible and versatile way to construct textual output for various applications.",
        "id": 5
      },
      {
        "title": "Print Secret Key",
        "tags": "API, Flask, Secret Key",
        "languageSelect": "Python",
        "code": "python -c 'import os; print(os.urandom(16))'",
        "explanation": "o generate random bytes in Python for cryptographic use, you can use the os.urandom() method. This method returns a string representing random bytes suitable for cryptographic purposes. The size parameter determines the number of random bytes to generate.\n\n\nEach time you run this code, a different set of random bytes will be output. \n\nWhen working with the output of os.urandom(), it's important to understand that the result is in bytes format. You can manipulate these bytes further for cryptographic operations or convert them into a different format as needed.",
        "id": 6
      }
    ]
  }